WINDOW_WIDTH = 500
WINDOW_HEIGHT = 550
MIN_WIDTH = 400
MIN_HEIGHT = 450

BG_COLOR = "#0a0101"
STATUS_BAR_COLOR = "#e0e0e0"
BUTTON_BG = "white"
X_COLOR = "red"
O_COLOR = "blue"
WINNER_COLOR = "lightgreen"

GAME_TITLE = "Крестики-нолики"
RULES_TEXT = """
ПРАВИЛА ИГРЫ "КРЕСТИКИ-НОЛИКИ"

1. Игроки по очереди ставят на свободные клетки поля 3×3 знаки: X или O.

2. Первый игрок ставит X, второй - O.

3. Выигрывает игрок, который первым выстроит в ряд 3 своих фигуры по вертикали, горизонтали или диагонали.

4. Если все клетки заполнены, но ни один игрок не выиграл, игра заканчивается ничьей.
"""

ABOUT_TEXT = """
КРЕСТИКИ-НОЛИКИ

Автор: Артём Неронов ИДБ-24-15

Лабораторная работа по программированию.
Реализовано с использованием Python и Tkinter.
"""